try_glasses_1/app/controllers/clients_controller.rb

  def index
    @clients = Client.all
    @eyeGlass = EyeGlass.all
---
SELECT "clients".* FROM "clients"
SELECT "eye_glasses".* FROM "eye_glasses"

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 4 LIMIT 1

  def edit
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 5 LIMIT 1

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("updated_at", "image_url", "user_name", "created_at", "gender", "frame_url") VALUES ('2011-03-31 17:43:35.526499', 'images/frame_6_model.png', 'terry23', '2011-03-31 17:43:35.526499', 'Male', 'images/frame_6.png')

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
UPDATE "clients" SET "updated_at" = '2011-03-31 20:26:39.942735', "frame_url" = 'images/frame_6.png', "user_name" = 'terry23', "gender" = 'Male', "image_url" = 'images/frame_6_model.png' WHERE "clients"."id" = 1

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1
DELETE FROM "clients" WHERE "clients"."id" = 1