try_glasses_1/app/controllers/eye_glasses_controller.rb

  def index
    @eye_glasses = EyeGlass.all
---
SELECT "eye_glasses".* FROM "eye_glasses"

  def show
    @eye_glass = EyeGlass.find(params[:id])
---
SELECT "eye_glasses".* FROM "eye_glasses" WHERE "eye_glasses"."id" = 6 LIMIT 1

  def edit
    @eye_glass = EyeGlass.find(params[:id])
---
SELECT "eye_glasses".* FROM "eye_glasses" WHERE "eye_glasses"."id" = 8 LIMIT 1

  def create
    @eye_glass = EyeGlass.new(params[:eye_glass])

    respond_to do |format|
      if @eye_glass.save
---
INSERT INTO "eye_glasses" ("who_can_wear", "updated_at", "material", "frame_url", "price", "shape", "image_url", "created_at", "name", "color") VALUES ('female', '2011-03-31 17:43:35.715693', 'plastic', 'images/frame_1.pgn', 29.12, 'square', 'images/frame_1_model.png', '2011-03-31 17:43:35.715693', 'terry Co', 'white')

  def update
    @eye_glass = EyeGlass.find(params[:id])

    respond_to do |format|
      if @eye_glass.update_attributes(params[:eye_glass])
---
SELECT "eye_glasses".* FROM "eye_glasses" WHERE "eye_glasses"."id" = 8 LIMIT 1
UPDATE "eye_glasses" SET "updated_at" = '2011-03-31 21:59:19.020436', "image_url" = 'images/frame_1_model.png', "name" = 'terry Co', "price" = 29.12, "color" = 'white', "frame_url" = 'images/frame_1.pgn' WHERE "eye_glasses"."id" = 1

  def destroy
    @eye_glass = EyeGlass.find(params[:id])
    @eye_glass.destroy
---
SELECT "eye_glasses".* FROM "eye_glasses" WHERE "eye_glasses"."id" = 6 LIMIT 1
DELETE FROM "eye_glasses" WHERE "eye_glasses"."id" = 6