try_glasses_1/app/controllers/model_images_controller.rb

  def index
    @model_images = ModelImage.all
---
SELECT "model_images".* FROM "model_images"

  def show
    @model_image = ModelImage.find(params[:id])
---
SELECT "model_images".* FROM "model_images" WHERE "model_images"."id" = 980190962 LIMIT 1

  def edit
    @model_image = ModelImage.find(params[:id])
---
SELECT "model_images".* FROM "model_images" WHERE "model_images"."id" = 980190962 LIMIT 1

  def create
    @model_image = ModelImage.new(params[:model_image])

    respond_to do |format|
      if @model_image.save
---
INSERT INTO "model_images" ("updated_at", "image_url", "created_at", "gender") VALUES ('2011-03-31 22:09:06.362858', 'images/frame_5_model.png', '2011-03-31 22:09:06.362858', 'male')

  def update
    @model_image = ModelImage.find(params[:id])

    respond_to do |format|
      if @model_image.update_attributes(params[:model_image])
---
SELECT "model_images".* FROM "model_images" WHERE "model_images"."id" = 980190962 LIMIT 1
UPDATE "model_images" SET "updated_at" = '2011-03-31 22:09:06.453253', "image_url" = 'images/frame_5_model.png', "gender" = 'male' WHERE "model_images"."id" = 980190962

  def destroy
    @model_image = ModelImage.find(params[:id])
    @model_image.destroy
---
SELECT "model_images".* FROM "model_images" WHERE "model_images"."id" = 51848956 LIMIT 1
DELETE FROM "model_images" WHERE "model_images"."id" = 51848956