try_glasses_1/app/views/clients/index.html.erb

SELECT "clients".* FROM "clients"
---
*/
$("a").live('click', function(e)
{
	e.preventDefault();
    var mainImage = $(this).attr("href");
	var id = this.id;
	$("#model img").attr("src", mainImage);
	$.getJSON("clients.json",function(result,suc)
	{
		for (i=0;i<=result.length;i++)
		{
			if(result[i].id == id)
            {
                var content = "<div id = 'eyeglassstable' class='rightbodybottom'><font color ='#FFFFFF' >" + "<table id = info><tr><td>"+"  Name:"  + result[i].name +"</td>";
				content +=  " <td>&nbsp; &nbsp;</td><td> Material:" + result[i].material + " </td><td>&nbsp; &nbsp;</td><td></td><td>color: " + result[i].color;
				content +=  "</td></tr><tr><td>Shape:" + result[i].shape + "</td><td>&nbsp; &nbsp;</td><td>Price:" + result[i].price + "</td></tr></table></div>";
                $('#eyeglassstable'). replaceWith( content );
            }
        }
    });
});