try_glasses_1/app/views/eye_glasses/_form.html.erb

      <%= f.label :material %>
      <% #material = EyeGlass.find(:all, :select => 'DISTINCT material') %>
---
SELECT "eye_glasses".* FROM "eye_glasses" WHERE "eye_glasses"."id" = 8 LIMIT 1

      <%= f.label :color %>
      <% # color = EyeGlass.find(:all, :select => 'Distinct color') %>
---
SELECT Distinct color FROM "eye_glasses" WHERE "eye_glasses"."color" IS NULL

      <%= f.label :shape %>
      <% shape = EyeGlass.find(:all, :select => 'Distinct shape') %>
---
SELECT Distinct shape FROM "eye_glasses" WHERE "eye_glasses"."shape" IS NULL